ruby-test/app/controllers/application_controller.rb

  def users
    # This endpoint demonstrates database tracing
    # Will generate SQL query spans automatically via ActiveRecord instrumentation

    # SELECT ALL users
    all_users = User.all.to_a

    # SELECT with WHERE clause
    adult_users = User.where("age >= ?", 18).to_a

    # COUNT query
    total_count = User.count

    # FIND by ID
    first_user = User.find_by(id: 1)
---
SELECT "users".* FROM "users" WHERE (age >= ?)  [[nil, 18]]
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]